## DataFrame 병합

In [ ]:
import numpy as np
import pandas as pd

### merge

특정 컬럼 기준으로 DataFrame 병합
```
 pd.merege(df1, df2, on, how)
```


- on : merge 기준 컬럼(지정하지 않으면 같은 이름의 컬럼을 기준으로 함)
- how : inner(기본값), outer, left, right

In [ ]:
df1 = pd.DataFrame({
    'id' : [1,2,3,4],
    'name' : ['다람쥐','토기','개구리','카피바라'],
})

df2 = pd.DataFrame({
    'id' : [1,2,3,4],
    'class_no' : [4,2,1,7]
})

In [ ]:
pd.merge(df1,df2)

   id  name  class_no
0   1   다람쥐         4
1   2    토기         2
2   3   개구리         1
3   4  카피바라         7

In [ ]:
df1 = pd.DataFrame({
    'id' : [1,2,3,4],
    'name' : ['다람쥐','토기','개구리','카피바라'],
})

df2 = pd.DataFrame({
    'id' : [1,2,3,5],
    'class_no' : [4,2,1,7]
})

pd.merge(df1,df2)

# 결과가 1,2,3 만 나옴

   id name  class_no
0   1  다람쥐         4
1   2   토기         2
2   3  개구리         1

In [ ]:
# df1 = pd.DataFrame({
#     'id' : [1,2,3,4],
#     'name' : ['다람쥐','토기','개구리','카피바라'],
# })

# df2 = pd.DataFrame({
#     'tid' : [1,2,3,5],  #id =-> tid로 변경을 했는데 에러가 발생
#     'class_no' : [4,2,1,7]
# })
pd.merge(df1,df2)

   id name  class_no
0   1  다람쥐         4
1   2   토기         2
2   3  개구리         1

In [ ]:
df1 = pd.DataFrame({
    'id' : [1,2,3,4],
    'name' : ['다람쥐','토기','개구리','카피바라'],
})

df2 = pd.DataFrame({
    'id' : [1,2,3,5],
    'class_no' : [4,2,1,7]
})

# pd.merge(df1,df2)


# pd.merge(df1, df2, on='id',how='inner')# 이것과 같은 상황

In [ ]:
pd.merge(df1, df2, on='id',how='inner')# 이것과 같은 상황

   id name  class_no
0   1  다람쥐         4
1   2   토기         2
2   3  개구리         1

In [ ]:
df1 = pd.DataFrame({
    'tid' : [1,2,3,4],
    'name' : ['다람쥐','토기','개구리','카피바라'],
})

df2 = pd.DataFrame({
    'cid' : [1,2,3,5],
    'class_no' : [4,2,1,7]
})

# 양쪽 데이터프레임에 있는 것들이 다를 때는  left on right on이렇게 엮어 줘야됨
pd.merge(df1, df2, left_on='tid', right_on ='cid')

   tid name  cid  class_no
0    1  다람쥐    1         4
1    2   토기    2         2
2    3  개구리    3         1

### join
- 특정 인덱스 기준으로 병합을 한다
```
df1.join(df2)
```
- how : inner, left(기본값), right, outer

In [ ]:
df3 = pd.DataFrame({
    'voice_key' : [1,3,5,7],
    'city' :['서울','수원','인천','서울']
}, index=['박효신','김범수','나얼','남윤진'])
df4 = pd.DataFrame({
    'pet' : ['고양이','강아지','햄스터','다람쥐']
}, index = ['박효신','김범수','나얼','윤진'])

In [ ]:
df4

     pet
박효신  고양이
김범수  강아지
나얼   햄스터
남윤진  다람쥐

In [ ]:
df3.join(df4)

     voice_key city  pet
박효신          1   서울  고양이
김범수          3   수원  강아지
나얼           5   인천  햄스터
남윤진          7   서울  다람쥐

In [ ]:
df3.join(df4,how='left')

     voice_key city  pet
박효신          1   서울  고양이
김범수          3   수원  강아지
나얼           5   인천  햄스터
남윤진          7   서울  NaN

In [ ]:
df3.join(df4,how='right')  # 오른쪽 기준

     voice_key city  pet
박효신        1.0   서울  고양이
김범수        3.0   수원  강아지
나얼         5.0   인천  햄스터
윤진         NaN  NaN  다람쥐

In [ ]:
df3.join(df4,how='outer')

     voice_key city  pet
김범수        3.0   수원  강아지
나얼         5.0   인천  햄스터
남윤진        7.0   서울  NaN
박효신        1.0   서울  고양이
윤진         NaN  NaN  다람쥐

In [ ]:
df3.join(df4,how='inner')

     voice_key city  pet
박효신          1   서울  고양이
김범수          3   수원  강아지
나얼           5   인천  햄스터

### concat
- 축을 기준으로 병합

In [ ]:
df5 = pd.DataFrame({
    'name' : ['구준표','윤지후','소이정','프린스송'],
    'age' : [18,18,18,18]
})
df6 = pd.DataFrame({
    'name' : ['금잔디'],
    'age' : [17]
})

In [ ]:
pd.concat([df5,df6], axis=0).reset_index(drop=True)

   name  age
0   구준표   18
1   윤지후   18
2   소이정   18
3  프린스송   18
4   금잔디   17

In [ ]:
a =pd.concat([df5,df6], axis=1).reset_index(drop=True)
a

   name  age name   age
0   구준표   18  금잔디  17.0
1   윤지후   18  NaN   NaN
2   소이정   18  NaN   NaN
3  프린스송   18  NaN   NaN

### Melt
- 열 병합

In [ ]:
df = pd.DataFrame({
    'name' : ['RM', '정국', '지민', '뷔'],
    'math' : [80, 90, 100, 100],
    'english' : [100, 90, 80, 60],
    'science' : [99, 77, 43, 100]
})

In [ ]:
pd.melt(
    df,
    id_vars = ['name'],                         # 고정 (유지) 될 컬럼
    value_vars= ['math','english', 'science']   # 합쳐질 컬럼
)

   name variable  value
0    RM     math     80
1    정국     math     90
2    지민     math    100
3     뷔     math    100
4    RM  english    100
5    정국  english     90
6    지민  english     80
7     뷔  english     60
8    RM  science     99
9    정국  science     77
10   지민  science     43
11    뷔  science    100

In [ ]:
pd.melt(
    df,
    id_vars = ['name'],                         # 고정 (유지) 될 컬럼
    value_vars= ['math','english', 'science'],  # 합쳐질 컬럼
    var_name = 'subject',
    value_name= 'score'
)
df

  name  math  english  science
0   RM    80      100       99
1   정국    90       90       77
2   지민   100       80       43
3    뷔   100       60      100

: